'''
변수 - 값을 담을 수 있는 메모리 저장 공간

변수명 = 값

변수타입(값 종류)
기본형
    1. 불린(boollean) - True, False
        불린변수1 = True
        불린변수2 = False
    2. 정수(int) - 메모리 허용 음수, 0 , 양수 (파이썬은 상관없다 -21억정도 ~ 0 ~ 21억정도)
        num1 = 1
        num2 = 2
    3. 실수(float) - 소수점 포함 숫자
        fNum = 3.14
        fNum = 2.7
    4. 문자열(str) - 문자 저장 큰 따옴표 ("") 또는 작은 따옴표 ('')
        str1 = "Hello Python"
        str2 = '안녕하세요!'

컬렉션형(자료구조형) -
    1. list - 순서가 있는 데이터 집합
        list1 = ['값1','값2','값3']
        list2 = ['값1', 10, 3.14]
    2. tuple - list 비슷하지만 수정 불가능
        tuple1 = ('값1', '값2', '값3')
        tuple2 = ('값1', 10, 3.14)
    3. set - 순서가 없고, 중복허용하지 않는 데이터 집합
        set1 = {'값1', '값2', '값3'}
        set2 = {'값1', 10, 3.14}

변수명.메소드()

메소드는 검색해서 사용한다 코딩 시험 같은 경우는 자주 쓰는 메소드를 외워서 해야겠지


'''